{
  "count": "107",
  "links": [
    "https://www.linkedin.com/learning/learning-cobol/welcome",
    "https://www.linkedin.com/learning/learning-zoom/stay-connected-with-zoom-meetings",
    "https://www.linkedin.com/learning/security-testing-nmap-security-scanning/next-steps",
    "https://www.linkedin.com/learning/learning-bash-scripting/welcome",
    "https://www.linkedin.com/learning/learn-industrial-automation/next-steps",
    "https://www.linkedin.com/learning/comptia-network-plus-n10-007-cert-prep-9-managing-the-network/snmp",
    "https://www.linkedin.com/learning/learning-ansible/next-steps",
    "https://www.linkedin.com/learning/sql-essential-training-3/goodbye",
    "https://www.linkedin.com/learning/learning-google-cloud-iot-core/testing-the-circuit",
    "https://www.linkedin.com/learning/learning-typescript-2/conclusion"
  ],
  "titles": [
    "Learning COBOL",
    "Learning Zoom",
    "Security Testing: Nmap Security Scanning",
    "Learning Bash Scripting",
    "Learn Industrial Automation",
    "CompTIA Network+ (N10-007) Cert Prep: 9 Managing the Network",
    "Learning Ansible",
    "SQL Essential Training",
    "Learning Google Cloud IoT Core",
    "Learning TypeScript"
  ],
  "authors": [
    "By: Peggy Fisher",
    "By: Garrick Chow",
    "By: Mike Chapple",
    "By: Scott Simpson",
    "By: Zahraa Khalil",
    "By: Mike Meyers",
    "By: Jesse Keating",
    "By: Bill Weinman",
    "By: Lee Assam",
    "By: Jess Chadwick"
  ],
  "released": [
    "Released Dec 8, 2015",
    "Updated 1 week ago",
    "Updated Jan 30, 2019",
    "Released Nov 26, 2013",
    "Released Mar 6, 2018",
    "Released Aug 28, 2018",
    "Released Mar 27, 2017",
    "Released 4 months ago",
    "Released Oct 30, 2019",
    "Released Jul 8, 2019"
  ],
  "duration": [
    "3h 4m",
    "1h 3m",
    "1h 46m",
    "1h 25m",
    "40m",
    "3h 19m",
    "59m",
    "3h 0m",
    "2h 54m",
    "1h 8m"
  ],
  "completed": [
    "Completed 4/21/2020",
    "Completed 4/4/2020",
    "Completed 4/13/2020",
    "Completed 7/14/2019",
    "Completed 4/12/2020",
    "Completed 2/24/2020",
    "Completed 4/9/2020",
    "Completed 4/4/2020",
    "Completed 3/30/2020",
    "Completed 4/1/2020"
  ],
  "imgs": [
    "https://media-exp1.licdn.com/media-proxy/ext?w=512&h=288&f=n&hash=JRn7eW3rcq8bVpRLiDdiAhrFtpk%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6plxVUzgUv5K_PrkC9q0RIUJDPBy-lWiSp_dKfZHboesDYZLSiolgScC4HlQc2fOagSTPpGo69LcLmY4Yx3A",
    "https://media-exp1.licdn.com/media-proxy/ext?w=512&h=288&f=n&hash=PPDTvXKpPRwU6LtNg%2BensahAq68%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6plxVUzgUv5K_PrkC9q0RIUJDPBy-jUyWq-deIf3Xhecfce7q8pVgQeCgEmQ07fOesQy3gFNu1NdCvKg",
    "https://media-exp1.licdn.com/media-proxy/ext?w=512&h=288&f=n&hash=fOVY5rtJvOtKk1YuSmB1APKMVHs%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6plxVUzgUv5K_PrkC9q0RIUJDPBy-mXyWu-t2fZ3PpfcfXZLSioloUcSoEkQw7feutRTbnEY69LcLmY4Yx3A",
    "https://media-exp1.licdn.com/media-proxy/ext?w=512&h=288&f=n&hash=eOaibQNlpa%2Fv59tjYwihddAz6F0%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6plxVUzgUv5K_PrkC9q0RIUJDPBy-gXyej8tyfYXPrcM_WZLSiol8SfisHkwMweuavQzfnEY69LcLmY4Yx3A",
    "https://media-exp1.licdn.com/media-proxy/ext?w=512&h=288&f=n&hash=xXsBXrAJCZ%2F09dvnZlpvGZamXzI%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6plxVUzgUv5K_PrkC9q0RIUJDPBy-nXSSt_N2fZnHofsHXZLSiolgTfS0HlQI6e--uSDLoFo69LcLmY4Yx3A",
    "",
    "",
    "",
    "",
    ""
  ],
  "linkedin": [
    "https://www.linkedin.com/in/peggyfisher145?trk=lil_course",
    "https://www.linkedin.com/in/garrickchow?trk=lil_course",
    "https://www.linkedin.com/in/mikechapple?trk=lil_course",
    "https://www.linkedin.com/in/scotts82?trk=lil_course",
    "https://www.linkedin.com/in/zahraakhalil?trk=lil_course",
    "https://www.linkedin.com/in/mike-meyers-7611874?trk=lil_course",
    "",
    "https://www.linkedin.com/in/bweinman?trk=lil_course",
    "https://www.linkedin.com/in/lee-assam?trk=lil_course",
    "https://www.linkedin.com/in/jesschadwick?trk=lil_course"
  ],
  "details": [
    "COBOL is an endangered language. But it once ran 80% of the world's business systems: thousands of mission-critical applications that still exist today. Some companies want to upgrade and transition their COBOL applications to more modern frameworks; others want to stick with COBOL's relatively stable platform. In either case, hiring managers are willing to pay a premium for candidates who know how to take on COBOL's challenges. For this reason, programmers are learning COBOL again.\n\nThis course is designed to help new and experienced programmers alike add COBOL (or add COBOL back) to their skill set. Peggy Fisher shows how to get a COBOL development environment up and running and how to start programming. She reviews COBOL's data types and constants, control structures, file storage and processing methods, tables, and strings. Challenges issued along the way will help you practice what you've learned.",
    "Collaborate more seamlessly using Zoom, the popular video conferencing tool. In this course, staff instructor Garrick Chow shows how to schedule, moderate, and participate in Zoom meetings. Garrick begins by showing how to set up your Zoom account and adjust audio and video settings. Next, he walks through joining and participating in meetings scheduled by others. Garrick covers how to use a variety of options during meetings such as adjusting views, muting your microphone, turning your video camera on and off, and sharing your screen. Finally, Garrick demonstrates how to host your own Zoom meetings, from scheduling and adjusting moderator settings to recording meetings.",
    "Nmap is a powerful network discovery and security auditing tool that's widely used in the cybersecurity community. In this course, learn how to use this open-source tool for port scanning of systems and network devices. Instructor Mike Chapple demonstrates how to install Nmap, configure scans, and interpret the output. Plus, he wraps up the course with a series of hands-on case studies, providing you with an opportunity to perform your own Nmap scans and check your results.",
    "Bash, or the Bourne Again Shell, is a widely popular command-line interpreter for administration and programming tasks. It's also the default option on Mac OS X and Linux. But Bash is different than most scripting languages. That's why Scott Simpson spends some time in this course running you through the syntax—introducing variables, numbers, and control structures—so you can start writing scripts right away. He shows you how to wrap up multiline operations in one file, implement flow control, and interact with users to get input. Plus, he offers challenges along the way that allow you to put what you've learned to the test.",
    "Industrial automation is the use of computers and robots to control industrial processes, like manufacturing, without significant human intervention. Used correctly, automation can increase the quality, safety, and accuracy of these processes. It's the job of the people in industrial automation to design the systems, configure the controllers, and monitor the processes. This course provides an overview of the topic, designed to help anyone hoping to enter the field in a role such as electrical or mechanical engineer, automation technician, or design manager.\n\nLearn about the components and networks involved at each level of automation: field level, control level, and management level. Explore the different devices involved, from the programmable logic controllers (PLCs) on the factory floor, to OPC software that give technicians insights into operations. Instructor Zahraa Khalil, an engineer and educator, also provides an overview of SCADA (supervisory control and data acquisition), an industrial control system architecture that enables supervision over large distances and multiple sites.",
    "Validate your ability to configure, manage, and maintain networks by earning the CompTIA Network+ certification. In this course—the final installment in the nine-part CompTIA Network+ Cert Prep series—instructor Mike Meyers helps to prepare you for the CompTIA Network+ exam (N10-007) as he covers essential network operations, network security, and network troubleshooting and tools exam concepts. Mike goes over network management, including risk management and change management, threats, firewalls, and system monitoring. He also discusses network troubleshooting theory, going over each of the key steps you should follow to resolve a network issue.\n\nThis course was recorded and produced by Total Seminars. We're pleased to host this training in our library.\n\nWe are a CompTIA Content Publishing Partner. As such, we are able to offer CompTIA exam vouchers at a 10% discount. For more information on how to obtain this discount, please download these PDF instructions.",
    "Automation tools can help transform unwieldly IT tasks—managing zero downtime rolling updates, for example—into something far more manageable. In this course, explore Ansible, an easy-to-use IT automation engine. To begin, instructor Jesse Keating explains what the Ansible system is, and how to install Ansible on a Linux operating system so you can start experimenting with it. Next, Jesse goes into the different components in an Ansible system, covering concepts such as how to work with hosts and variables and control task and play behavior. After he goes over the fundamental concepts of this system, Jesse shares some of the high-level use cases that Ansible was designed to tackle.",
    "Knowing how to code and manage relational databases and database-driven applications is a valuable skill for any career in tech. Completely updated for 2019, SQL Essential Training is designed to help users understand the most common language for database wrangling, SQL. All the lessons have been recorded in SQLiteStudio, an intuitive and easy-to-install database manager. Instructor Bill Weinman teaches all the major features of SQL: creating tables; defining relationships; manipulating strings, numbers, and dates; using triggers to automate actions; and using subselects and views. He offers a solid working knowledge of the language and shows how to retrieve and manage data efficiently. The final chapter includes a real-world example of building a simple application using SQL.\n\nThis course was created by Bill Weinman. We are pleased to offer this training in our library.",
    "The Internet of Things (IoT) has infused an array of devices—from watches to doorbells—with features that keep us more connected and informed than ever before. But with IoT devices becoming more mainstream, developers and IoT architects need tools that support them as they create, deploy, and secure an increasing number of IoT devices. Google Cloud IoT Core—a fully managed service for connecting and managing IoT devices—is one such tool. In this course, learn how to build out IoT applications with Google Cloud IoT Core. Instructor Lee Assam details the challenges of scaling IoT, and then explains how to provision and secure edge devices, set up a virtual device, set up a connected edge device, use an IoT gateway, and more.",
    "TypeScript adds discipline to JavaScript development. You can find errors in your code before you execute it, and leverage productivity enhancements like variable and property renaming. Despite its many parts—types, annotations, interfaces, and classes—adding TypeScript to your workflow doesn't have to be difficult. Join web developer Jess Chadwick as he walks you through the foundations, helping you set up TypeScript and use it in simple ways to improve existing JavaScript projects. Learn how to define custom types, convert existing JavaScript classes to TypeScript classes, and encapsulate your logic and data with access modifiers. Plus, find out how to reuse code with generics, type check files, and add type support for APIs. Using these techniques, you can become a more productive, efficient JavaScript developer."
  ]
}